## Day 29: How do I create a pandas DataFrame from another object?
https://courses.dataschool.io/view/courses/pandas-in-30-days/2341096-course-videos/7587905-day-29-how-do-i-create-a-pandas-dataframe-from-another-object

In [1]:
import pandas as pd

In [2]:
pd.DataFrame({'id': [100,101,102], 'color': ['red', 'blue', 'red']})

    id color
0  100   red
1  101  blue
2  102   red

In [3]:
pd.DataFrame({'id': [100,101,102], 'color': ['red', 'blue', 'red']}, columns=['color', 'id'])

  color   id
0   red  100
1  blue  101
2   red  102

In [23]:
df = pd.DataFrame({'id': [100,101,102], 'color': ['red', 'blue', 'red']}, columns=['color', 'id'], index=['a','b','c'])

In [8]:
pd.DataFrame([[100,'red'], [101,'blue'], [102,'red']])

     0     1
0  100   red
1  101  blue
2  102   red

In [9]:
pd.DataFrame([[100,'red'], [101,'blue'], [102,'red']], columns=['id', 'color'])

    id color
0  100   red
1  101  blue
2  102   red

In [10]:
import numpy as np

In [11]:
arr = np.random.rand(4,2)

In [12]:
arr

array([[0.01018478, 0.09769164],
       [0.26544933, 0.60307659],
       [0.02795969, 0.87861056],
       [0.34229435, 0.99767243]])

In [13]:
pd.DataFrame(arr, columns=['one', 'two'])

        one       two
0  0.010185  0.097692
1  0.265449  0.603077
2  0.027960  0.878611
3  0.342294  0.997672

In [17]:
pd.DataFrame({'student': np.arange(100,110,1), 'test': np.random.randint(60,101,10)})

   student  test
0      100    90
1      101    76
2      102    65
3      103    64
4      104    71
5      105    79
6      106    84
7      107    84
8      108    70
9      109    66

In [18]:
pd.DataFrame({'student': np.arange(100,110,1), 'test': np.random.randint(60,101,10)}).set_index('student')

         test
student
100        74
101        77
102        70
103        80
104        97
105        77
106        63
107        98
108        74
109        66

In [21]:
# Bonus
# How do I create a new Series and attach it to the DataFrame
s = pd.Series(['round', 'square'], index=['c','b'], name='shape')
s

c     round
b    square
Name: shape, dtype: object

In [24]:
df

  color   id
a   red  100
b  blue  101
c   red  102

In [25]:
pd.concat([df, s], axis=1)

  color   id   shape
a   red  100     NaN
b  blue  101  square
c   red  102   round